{
   "color": {
      "description": "Color",
      "message": "Color"
   },
   "color_black": {
      "description": "Black",
      "message": "Black"
   },
   "color_blue": {
      "description": "Blue",
      "message": "Blue"
   },
   "color_green": {
      "description": "Green",
      "message": "Green"
   },
   "color_red": {
      "description": "Red",
      "message": "Red"
   },
   "color_white": {
      "description": "White",
      "message": "White"
   },
   "color_yellow": {
      "description": "Yellow",
      "message": "Yellow"
   },
   "ext_description": {
      "description": "Extension description.",
      "message": "Highlight any part of a page by drawing a selection rectangle like on your desktop."
   },
   "help": {
      "description": "Help button tooltip.",
      "message": "Help"
   },
   "help_text": {
      "description": "Help text in modal window that describes the functionality.",
      "message": "\u003Cdiv class='srh_modal_h1'>Selection Rectangle Highlighting v2.0 - Help\u003C/div>\u003Cdiv class='srh_modal_h2'>General usage\u003C/div>\u003Cdiv class='srh_modal_p'>By clicking the Selection Rectangle Highlighting icon in the Chrome extension bar (usually to the right of the address bar) you activate the highlighting mode. You can draw selection rectangles by clicking and holding down your mouse button in any area of the current page. The extension needs to be activated on every page/tab you want to use it.\u003C/div>\u003Cdiv class='srh_modal_p'>Additionally, an option window will open that allows you to change the color of the rectangle that you are drawing. You can minimize this window by clicking the arrow in the top right corner of it. If the window is obscuring important parts of your page, you can move it around by drag and drop.\u003C/div>\u003Cdiv class='srh_modal_h2'>Permanent mode\u003C/div>\u003Cdiv class='srh_modal_p'>In default mode, your drawn rectangles disappear as soon as you release your mouse button. If you activate \"permanent mode\" by checking the box in the options window, all your rectangles will stay on the page.\u003C/div>\u003Cdiv class='srh_modal_p'>You can remove individual rectangles by clicking them. To remove all rectangles, disable \"permanent mode\" again or press the \"C\" key on your keyboard.\u003C/div>\u003Cdiv class='srh_modal_h2'>Disable\u003C/div>\u003Cdiv class='srh_modal_p'>If you want to stop using the Selection Rectangle Highlighting functionality and want to access the content of the page as usual, you can either click the extension icon once again, click the \"X\" in the options window, or hit the \"Escape\" key on your keyboard.\u003C/div>\u003Cdiv class='srh_modal_h2'>Limitations\u003C/div>\u003Cdiv class='srh_modal_p'>By design of the Chrome browser, you cannot use this extensions on any Chrome Web Store page or on internal pages with chrome:// URLs. If you want to use it on local file:// URL pages, you need to manually authorize this in the Chrome extension management area.\u003C/div>\u003Cdiv class='srh_modal_h2'>Keyboard shortcuts\u003C/div>\u003Cdiv class='srh_modal_p'>ESC ... disable drawing mode and close options window\u003Cbr/>1-6 ... change the rectangle color with the number keys from 1 to 6\u003Cbr/>P ... enable/disable permanent mode\u003Cbr/>C ... clear all rectangles in permanent mode\u003C/div>\u003Cdiv class='srh_modal_h2'>Contact the developer\u003C/div>\u003Cdiv class='srh_modal_p'>Visit my page: \u003Ca href='https://www.mjh.at/'>mjh.at\u003C/a>\u003C/div>"
   },
   "launch_error": {
      "description": "Error message that is shown if the extension cannot be used on the current page.",
      "message": "Activation prevented by the browser. Please try again on a different page. This extension cannot be used on chrome:// URLs or on the Chrome Web Store. It works on file:// URLs if you authorize it via the extension management page in Chrome."
   },
   "maximize": {
      "description": "Maximize button tooltip.",
      "message": "Maximize"
   },
   "minimize": {
      "description": "Minimize button tooltip.",
      "message": "Minimize"
   },
   "options_heading": {
      "description": "Options window title.",
      "message": "Options"
   },
   "permanent_mode": {
      "description": "Permanent mode checkbox label.",
      "message": "Permanent mode"
   },
   "permanent_mode_short": {
      "description": "Permanent mode short name. Used when the options window is minimized.",
      "message": "perm"
   }
}
